//
//  Rules.swift
//  CrocodileChallenge
//
//  Created by Владислав Резник on 20.04.2023.
//

import Foundation

struct Rules {
    static func getRules() -> String {
        return "Игру «Крокодил» в нашей стране знают почти все. Даже те, кто её не знает, играют в неё с иностранцами во время турпоездок. Правила очень просты: нужно объяснять слова так, чтобы вас поняли. В классической компанейской игре объяснять нужно было жестами, более популярная версия для телевидения стала чуть шире по правилам, потом появился большое подарочное издание, а теперь вы держите в руках «Крокодил компакт». Это карманная версия игры, которую вы сможете взять куда угодно. Каждая команда идёт к победе своим путём, и этот путь состоит из карт с заданиями. Чтобы выиграть, вам нужно будет всего за одну минуту объяснить, нарисовать или показать другим игрокам загаданное слово. Вы можете облегчить свои объяснения специальными плюшками или усложнить задачу противника хитрыми ловушками. А в самом конце вас ждёт финальное задание, и тогда соперничать в скорости надо будет уже не с таймером, а с командой соперников!\nВ игру играют командами из двух или более человек. Задача каждого игрока команды - объяснить слово, которое он видит на экране, следуя условиям, которые дополнительно указаны под загаданным словом. Чем больше слов отгадала команда, тем больше она заработает баллов. Выигрывает команда, набравшая больше всего баллов. На отгадывание слова дается одна минуту. При нарушении правил объяснения слова, ход передается следующей команде.\nВыигрывает та команда, у которой после выполнения финального задания будет больше всего победных очков.\nРазделитесь на команды. Как правило, двух команд вполне достаточно, но, если вас вдруг очень много либо вы хотите делиться по каким-то особым признакам, можно играть тремя или четырьмя командами. В каждой команде должно быть минимум два человека."
    }
}
